Table of Contents
 Class DesignMember
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
DesignMember
[OpenModelClass("CI.Common.CheckMember.DesignMember,CI.ServicesCommon", "CI.Common.CheckMember.IDesignMember,CI.BasicTypes")]
public class DesignMember : OpenElementId
Inheritance
object
OpenObject
OpenElementId
DesignMember
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 DesignMember()
Constructor
public DesignMember()
Properties
 Members
Array of Member1D
public List<ReferenceElement> Members { get; set; }
Property Value
List<ReferenceElement>
List of Member1D
 Name
Name of Element
public string Name { get; set; }
Property Value
string
 Edit this page